<?php
$arComponentDescription = [
    "NAME" => "Горячие предложения", // Название компонента
    "DESCRIPTION" => "Выводит товары с отметкой 'Горячие предложения'", // Описание
    "ICON" => "/images/icon.gif", // Иконка (необязательно)
    "PATH" => [
        "ID" => "custom", // Пространство имён (namespace)
        "NAME" => "Custom Components", // Название группы компонентов
        "CHILD" => [
            "ID" => "hot_offers", // ID компонента
            "NAME" => "Горячие предложения" // Название компонента в группе
        ]
    ]
];
?>